Kryn-devv/Iris_AI/firmware/esp32-iris-node-bts7960/esp32-iris-node-bts7960.ino
/*
 * ============================================================================
 *  IRIS ROBOT NODE  —  2 x BTS7960, 4-wheel skid steer, ESP32
 * ============================================================================
 *
 *  WHAT THIS IS
 *  A WiFi motor controller for the IRIS assistant. IRIS calls plain HTTP
 *  endpoints; this board drives two BTS7960 half-bridge modules (one per side,
 *  each carrying two motors in parallel).
 *
 *  WHY YOU DO NOT NEED TO EDIT PINS OR DIRECTIONS ANY MORE
 *  Everything about the wiring — which pins, which side is which, which way is
 *  "forward", how fast each side runs — is CALIBRATED AT RUNTIME from the
 *  built-in web page and saved to flash. If a wheel spins the wrong way or a
 *  whole side looks dead, you fix it by clicking a button, not by re-wiring or
 *  re-flashing.
 *
 *  FIRST RUN
 *   1. Set WIFI_SSID / WIFI_PASS below. (That is the only edit required.)
 *   2. Upload, open Serial Monitor @115200, note the printed address.
 *      No router / wrong password? The board serves its OWN WiFi instead
 *      ("iris-robot", password below) — calibrate on the bench, no network.
 *   3. Open that address in a browser — the CALIBRATION page.
 *   4. Press "A fwd" and "B fwd" and watch which wheels move. Use the
 *      toggles until forward is really forward and left is really left.
 *      Press SAVE. Done, permanently.
 *   5. In IRIS:  add device robot at <that-ip> as motor
 *
 *  WIRING (per BTS7960 module)
 *    RPWM  -> an ESP32 GPIO      (PWM, "this way")
 *    LPWM  -> an ESP32 GPIO      (PWM, "the other way")
 *    R_EN + L_EN  -> tied TOGETHER to one GPIO (or straight to 3.3V).
 *                    Both modules may share ONE enable GPIO if you prefer.
 *    VCC   -> 5V   <-- REQUIRED. The BTS7960 logic side CONSUMES 5V; it does
 *                      not generate it. A module with VCC unconnected looks
 *                      completely dead. This is the #1 cause of "half my
 *                      driver does nothing".
 *    GND   -> ESP32 GND *and* battery minus (all grounds common)
 *    B+/B- -> motor battery (never the ESP32's 5V pin)
 *
 *  Default pins (changeable live from the web page):
 *    Side A: RPWM 25, LPWM 26, EN 27
 *    Side B: RPWM 32, LPWM 33, EN 14
 *
 *  HOW COMMANDS GET IN — three doors, one set of handlers
 *    UDP :8267    payload is exactly what would follow the host in a URL, e.g.
 *                 "/motor?dir=forward&speed=200". One datagram, no handshake:
 *                 this is the millisecond path, and what IRIS uses.
 *    ws  :81      the calibration page's control socket. Same strings, with a
 *                 request id, and /status is PUSHED back 10x a second.
 *    HTTP :80     the endpoints below, unchanged, plus the page itself.
 *  The HTTP server is the slow door and always was: it serves ONE client at a
 *  time and holds a socket that has connected but not yet spoken for up to five
 *  seconds. A browser opens exactly such idle sockets, so an open calibration
 *  page was enough to queue the next drive command behind it. That is where the
 *  "why is it so slow" came from; the two fast doors do not go through it.
 *  See fastlink.h.
 *
 *  HTTP API (unchanged for IRIS compatibility)
 *    GET /status                      full state + config JSON
 *    GET /motor?dir=forward|backward|left|right|stop|brake
 *                   [&speed=0..255][&ms=0]        drive; ms auto-stops
 *    GET /tank?left=-255..255&right=-255..255[&ms=]   per-side direct
 *    GET /drive?y=-255..255&x=-255..255[&ms=]         arcade mixing
 *    GET /test?side=a|b&dir=forward|backward[&speed=][&ms=]  RAW side test,
 *                   ignores swap/invert — the diagnosis primitive
 *    GET /selftest                    runs a timed A/B sequence, poll /status
 *    GET /stop                        immediate coast stop
 *    GET /config?...                  live calibration (see page)
 *    GET /save                        persist config to flash
 *    GET /reset                       restore defaults
 *
 *  Every numeric argument is parsed strictly: a typo is answered with HTTP 400,
 *  never silently treated as 0. On a motor controller "it quietly did something
 *  else" is the worst possible failure mode.
 *
 *  SAFETY
 *   - Motion stops automatically if no command arrives within failsafe_ms
 *     (default 10 s) — a dropped WiFi link can never leave motors running.
 *   - The web page drives only while a key or button is HELD (dead-man's
 *     switch); letting go stops immediately.
 *   - Motion stops immediately if the WiFi link carrying commands drops.
 *   - Speed ramps instead of stepping, so 4 motors cannot brown-out the board.
 *   - "Stop" really coasts: the bridges are DISABLED, not just set to 0 duty
 *     (enabled + 0 duty is a low-side short, i.e. locked wheels).
 * ============================================================================
 */

#include <WiFi.h>
#include <WebServer.h>
#include <ESPmDNS.h>
#include <Preferences.h>

#include "robot_config.h"
#include "cloud_args.h"
#include "cloud.h"
#include "fastlink.h"
#include "page.h"

/* ══════════════════════ EDIT THESE TWO LINES ══════════════════════ */
const char* WIFI_SSID = "YOUR_WIFI_NAME";
const char* WIFI_PASS = "YOUR_WIFI_PASSWORD";
const char* DEVICE_NAME = "robot";      /* also becomes http://robot.local */

/* ── IRIS in the cloud. Leave CLOUD_HOST empty for a LAN-only setup. ──
 * The robot is behind your router's NAT, so a VPS-hosted IRIS cannot call it;
 * with these set the board dials OUT instead and commands come back down the
 * same socket. CLOUD_TOKEN must equal NODE_LINK_TOKEN in IRIS's .env. */
const char* CLOUD_HOST  = "";           /* "iris.example.com" or an IP        */
const uint16_t CLOUD_PORT = 443;        /* 443 for https/wss, else yours      */
const bool CLOUD_TLS    = true;         /* false only on your own LAN         */
const char* CLOUD_TOKEN = "";           /* = NODE_LINK_TOKEN                  */
/* Optional CA (PEM, with the BEGIN/END lines). With it the certificate is
 * checked; empty means encrypted but unverified, and the board says so. */
const char* CLOUD_CA_CERT = "";
CloudLink cloud;
/* The millisecond command path: UDP :8267 for IRIS, a pushed WebSocket :81 for
 * the calibration page. Both bypass the HTTP server, which serves one client
 * at a time and can stall for seconds behind a browser's idle pre-connect
 * socket. See fastlink.h. */
FastLink fast;
const char* AP_PASSWORD = "iriscalib";  /* fallback network, min 8 chars */

