Kryn-devv/Iris_AI/firmware/esp32-iris-node-bts7960/esp32-iris-node-bts7960.ino
/* AP_ONLY: skip the router entirely and serve just my own WiFi.
 *
 * Worth it for a robot. Its own AP is the strongest link it will ever have —
 * you are standing next to it — with no router hop, no phone-hotspot client
 * isolation, and no 25 s join wait before the calibration page exists. That
 * matters most in exactly the situation where you need the page: a robot that
 * drives away from the access point.
 *
 * The cost is real and worth stating: a laptop joined to this AP is on the
 * robot's network and nothing else. IRIS running on that laptop can drive the
 * robot, but cannot reach the sensor or relay boards on your house WiFi, and
 * has no internet — so no LLM. Use AP_ONLY to calibrate and drive by hand;
 * leave it false for voice control alongside the other boards. */
const bool AP_ONLY = false;
/* ═════════════════════════════════════════════════════════════════ */

/* ───────────────────────── PWM back end ─────────────────────────── */
/* Explicit LEDC, configured ONCE. The Arduino analogWrite() helper
 * re-runs ledcSetup() on every write, which re-initialises the shared
 * hardware timer under a running channel (glitches, and silently does
 * nothing at all when its channel pool is exhausted). Motor PWM must
 * never be that fragile. Channels 0..3 -> timers 0,0,1,1 (same freq,
 * so sharing is safe). */
#define PWM_BITS       8            /* duty 0..255; PWM_DUTY_MAX in robot_config.h */
#define CH_A_R 0
#define CH_A_L 1
#define CH_B_R 2
#define CH_B_L 3

#define MS_MAX         600000L     /* longest timed move: 10 minutes */
#define WIFI_JOIN_MS   25000UL     /* then fall back to our own network */

static void pwmInit(uint8_t pin, uint8_t channel, uint32_t freq) {
#if ESP_ARDUINO_VERSION_MAJOR >= 3
  (void)channel;
  ledcAttach(pin, freq, PWM_BITS);
#else
  ledcSetup(channel, freq, PWM_BITS);
  ledcAttachPin(pin, channel);
#endif
}

static void pwmWrite(uint8_t pin, uint8_t channel, uint32_t duty) {
#if ESP_ARDUINO_VERSION_MAJOR >= 3
  (void)channel;
  ledcWrite(pin, duty);
#else
  (void)pin;
  ledcWrite(channel, duty);
#endif
}

/* Release a pin from its LEDC channel and hold it low.
 * ledcAttachPin() only ADDS a GPIO-matrix route; it never removes the previous
 * one. Without this, re-assigning a pin leaves the abandoned GPIO still driven
 * by the same channel — i.e. a motor input nobody thinks is connected any more. */
static void pwmDetach(uint8_t pin) {
  if (pin > 39) return;
#if ESP_ARDUINO_VERSION_MAJOR >= 3
  ledcDetach(pin);
#else
  ledcDetachPin(pin);
#endif
  pinMode(pin, OUTPUT);
  digitalWrite(pin, LOW);      /* a BTS7960 input must never be left floating */
}

/* ───────────────────────── configuration ────────────────────────── */

/* The Config type, the pin rules and the clamps live in robot_config.h — the
 * .ino preprocessor hoists prototypes above the sketch body, so a top-level
 * function here could not name Config in its signature. */

static Config cfg;
static Preferences prefs;

static void configDefaults() { configFillDefaults(cfg); }

static void configLoad() {
  configDefaults();
  if (!prefs.begin("irisbot", true)) return;      /* read-only; absent = defaults */
  cfg.aR  = prefs.getUChar("aR",  cfg.aR);
  cfg.aL  = prefs.getUChar("aL",  cfg.aL);
  cfg.aEn = prefs.getUChar("aEn", cfg.aEn);
  cfg.bR  = prefs.getUChar("bR",  cfg.bR);
  cfg.bL  = prefs.getUChar("bL",  cfg.bL);
  cfg.bEn = prefs.getUChar("bEn", cfg.bEn);
  cfg.swapSides = prefs.getBool("swap", cfg.swapSides);
  cfg.invA = prefs.getBool("invA", cfg.invA);
  cfg.invB = prefs.getBool("invB", cfg.invB);
  cfg.trimA = prefs.getUChar("trimA", cfg.trimA);
  cfg.trimB = prefs.getUChar("trimB", cfg.trimB);
  cfg.pwmFreq = prefs.getUShort("freq", cfg.pwmFreq);
  cfg.failsafeMs = prefs.getUShort("fail", cfg.failsafeMs);
  cfg.rampMs = prefs.getUShort("ramp", cfg.rampMs);
  cfg.defaultSpeed = prefs.getUChar("dspd", cfg.defaultSpeed);
  cfg.minDuty = prefs.getUChar("mind", cfg.minDuty);
  cfg.brakeOnStop = prefs.getBool("brake", cfg.brakeOnStop);
  prefs.end();

  /* A corrupt or hand-edited pin set must not brick the board on boot. */
  if (!pinsAllUsable(cfg) || pinConflict(cfg) >= 0) {
    Serial.println("[cfg] stored pins invalid or clashing — reverting to defaults");
    configDefaults();
  }
  configApplyClamps(cfg);
}

static bool configSave() {
  if (!prefs.begin("irisbot", false)) return false;
  prefs.putUChar("aR", cfg.aR);   prefs.putUChar("aL", cfg.aL);   prefs.putUChar("aEn", cfg.aEn);
  prefs.putUChar("bR", cfg.bR);   prefs.putUChar("bL", cfg.bL);   prefs.putUChar("bEn", cfg.bEn);
  prefs.putBool("swap", cfg.swapSides);
  prefs.putBool("invA", cfg.invA);   prefs.putBool("invB", cfg.invB);
  prefs.putUChar("trimA", cfg.trimA); prefs.putUChar("trimB", cfg.trimB);
  prefs.putUShort("freq", cfg.pwmFreq);
  prefs.putUShort("fail", cfg.failsafeMs);
  prefs.putUShort("ramp", cfg.rampMs);
  prefs.putUChar("dspd", cfg.defaultSpeed);
  prefs.putUChar("mind", cfg.minDuty);
  prefs.putBool("brake", cfg.brakeOnStop);
  prefs.end();
  return true;
}

/* ───────────────────────── motor state ──────────────────────────── */

WebServer server(80);

static int   targetA = 0, targetB = 0;   /* wanted signed duty, -255..255 */
static int   liveA   = 0, liveB   = 0;   /* actual, ramped toward target  */
static bool  brakingA = false, brakingB = false;
/* What was last actually written to the hardware. rampTick() only touches the
 * bridges when something changed, so the braking flags must be part of that
 * comparison — otherwise clearing a brake updates the flags while the wheels
 * stay physically locked. */
static bool  wroteBrakeA = false, wroteBrakeB = false;
/* A BTS7960 with EN high and both IN low turns its LOW-side FETs on, shorting
 * the motor: that is a brake, not a coast. Real coasting needs the bridges
 * disabled, so the enables are part of the stop state — and they are tracked
 * PER SIDE, because enabling both because one side is driving low-side-shorts
 * the idle one. That is what made a raw /test of side A lock side B's wheels,
 * during the one diagnostic that has to show each side in isolation. */
static bool  enA = false, enB = false;
static unsigned long lastRampMs   = 0;
static unsigned long lastCommandMs = 0;
static unsigned long autoStopAt    = 0;  /* 0 = no timed stop pending */
static unsigned long bootMs        = 0;
static bool  failsafeTripped = false;
static uint32_t commandCount = 0;
static bool  apMode = false;             /* serving our own network */
static bool  staAnnounced = false;

/* Fixed buffer, not a String: this is rewritten on every command, and heap
 * churn in a device meant to run for weeks is a slow leak waiting to happen. */
static char lastCommand[24] = "stop";
static void setLastCommand(const char* s) {
  strncpy(lastCommand, s, sizeof(lastCommand) - 1);
  lastCommand[sizeof(lastCommand) - 1] = '\0';
}

/* raw-mode bypasses swap/invert/trim: used by /test to identify hardware */
static bool rawMode = false;

/* self-test sequence (declared before doStop, which cancels it) */
static int  selfStep = -1;                 /* -1 = idle */
static unsigned long selfStepAt = 0;
static const char* SELF_LABELS[] = {
  "A forward", "A backward", "B forward", "B backward",
  "both forward", "spin left", "spin right", "done"
};
static const int SELF_STEPS = 7;

/* 0 is the "nothing pending" sentinel, so a deadline that lands exactly on 0
 * — once per millis() wrap — must be nudged rather than silently cancelled. */
static unsigned long deadlineFromNow(long ms) {
  const unsigned long t = millis() + (unsigned long)ms;
  return t ? t : 1;
}

/* Raise or drop the two BTS7960 enable inputs. Dropping one is the only way to
 * make that side truly free-wheel; raising it must precede any non-zero duty.
 *
 * The two may legitimately be the SAME GPIO — tying every R_EN/L_EN of both
 * modules together is a normal way to wire this — in which case the pin has to
 * be high whenever EITHER side needs its bridge, so both are always resolved
 * together rather than written independently. */
static void setEnables(bool a, bool b) {
  if (a == enA && b == enB) return;
  enA = a; enB = b;
  if (cfg.aEn == cfg.bEn) {
    digitalWrite(cfg.aEn, (enA || enB) ? HIGH : LOW);
    return;
  }
  digitalWrite(cfg.aEn, enA ? HIGH : LOW);
  digitalWrite(cfg.bEn, enB ? HIGH : LOW);
}

/* Each side's bridge is live exactly while that side has something to do: a
 * target, a ramp still winding down, or a brake being held. */
static void syncEnables() {
  setEnables((targetA != 0) || (liveA != 0) || brakingA,
             (targetB != 0) || (liveB != 0) || brakingB);
}

/* Write one physical side. signed: -255..255, negative = LPWM side. */
static void writeSide(bool sideA, int signedDuty, bool brake) {
  const uint8_t rp = sideA ? cfg.aR : cfg.bR;
  const uint8_t lp = sideA ? cfg.aL : cfg.bL;
  const uint8_t rc = sideA ? CH_A_R : CH_B_R;
  const uint8_t lc = sideA ? CH_A_L : CH_B_L;

