Kryn-devv/Iris_AI/firmware/esp32-iris-node-bts7960/esp32-iris-node-bts7960.ino
  if (brake) {                       /* both high = active brake */
    pwmWrite(rp, rc, PWM_DUTY_MAX);
    pwmWrite(lp, lc, PWM_DUTY_MAX);
    return;
  }
  int duty = signedDuty;
  if (duty > PWM_DUTY_MAX) duty = PWM_DUTY_MAX;
  if (duty < -PWM_DUTY_MAX) duty = -PWM_DUTY_MAX;
  if (duty >= 0) {
    pwmWrite(lp, lc, 0);
    pwmWrite(rp, rc, (uint32_t)duty);
  } else {
    pwmWrite(rp, rc, 0);
    pwmWrite(lp, lc, (uint32_t)(-duty));
  }
}

/* Claim every configured pin for PWM/enable use, releasing whatever was
 * claimed before. Safe to call at boot and on every live pin/frequency change;
 * it is the single place that touches the hardware routing. */
static uint8_t claimedPwm[4] = {255, 255, 255, 255};
static uint8_t claimedEn[2]  = {255, 255};

static void armHardware() {
  for (int i = 0; i < 4; i++) {
    if (claimedPwm[i] != 255) pwmDetach(claimedPwm[i]);
    claimedPwm[i] = 255;
  }
  for (int i = 0; i < 2; i++) {
    if (claimedEn[i] != 255) { pinMode(claimedEn[i], OUTPUT); digitalWrite(claimedEn[i], LOW); }
    claimedEn[i] = 255;
  }

  /* PWM first: enabling a bridge while its inputs are still undriven inputs
   * leaves the module reading floating pins, which can twitch a motor. */
  const uint8_t pins[4]  = { cfg.aR, cfg.aL, cfg.bR, cfg.bL };
  const uint8_t chans[4] = { CH_A_R, CH_A_L, CH_B_R, CH_B_L };
  for (int i = 0; i < 4; i++) {
    pwmInit(pins[i], chans[i], cfg.pwmFreq);
    claimedPwm[i] = pins[i];
  }
  writeSide(true, 0, false);
  writeSide(false, 0, false);
  wroteBrakeA = wroteBrakeB = false;

  /* Enables start LOW: nothing is moving yet, so coast. */
  pinMode(cfg.aEn, OUTPUT); digitalWrite(cfg.aEn, LOW); claimedEn[0] = cfg.aEn;
  pinMode(cfg.bEn, OUTPUT); digitalWrite(cfg.bEn, LOW); claimedEn[1] = cfg.bEn;
  enA = enB = false;
}

/* Defined with the ramp below; declared here because every function that
 * accepts a movement calls it to write the hardware immediately. */
static void rampKick();

/* Map a logical (left,right) request onto the physical sides, applying
 * calibration: swap -> invert -> trim -> deadband. */
static void applyLogical(int leftReq, int rightReq) {
  int a = cfg.swapSides ? rightReq : leftReq;
  int b = cfg.swapSides ? leftReq  : rightReq;
  if (cfg.invA) a = -a;
  if (cfg.invB) b = -b;
  a = (int)((long)a * cfg.trimA / 100);
  b = (int)((long)b * cfg.trimB / 100);
  if (cfg.minDuty) {
    if (a != 0 && abs(a) < cfg.minDuty) a = (a > 0 ? cfg.minDuty : -cfg.minDuty);
    if (b != 0 && abs(b) < cfg.minDuty) b = (b > 0 ? cfg.minDuty : -cfg.minDuty);
  }
  targetA = a; targetB = b;
  brakingA = brakingB = false;
  rawMode = false;
  syncEnables();     /* raise now, so the first ramp tick already has a bridge */
  rampKick();        /* ...and take that tick now rather than up to 2 ms later */
}

static void doStop(bool brake) {
  targetA = targetB = 0;
  liveA = liveB = 0;                 /* stopping is immediate, never ramped */
  brakingA = brakingB = brake;
  rawMode = false;
  autoStopAt = 0;
  /* A stop must also end a running self-test, or selfTestTick() re-energises
   * the motors ~900 ms later and undoes the failsafe / WiFi-loss stop. */
  selfStep = -1;
  if (brake) {
    syncEnables();                   /* braking, so both bridges stay live */
    writeSide(true,  0, true);       /* both inputs high = high-side brake */
    writeSide(false, 0, true);
  } else {
    writeSide(true,  0, false);      /* zero the inputs before cutting power */
    writeSide(false, 0, false);
    syncEnables();                   /* bridges off = genuine free-wheel */
  }
  wroteBrakeA = wroteBrakeB = brake;
  setLastCommand(brake ? "brake" : "stop");
}

/* direction -> logical (left,right) */
static bool directionToPair(const String& dir, int speed, int& l, int& r) {
  if (dir == "forward")  { l =  speed; r =  speed; return true; }
  if (dir == "backward") { l = -speed; r = -speed; return true; }
  if (dir == "left")     { l = -speed; r =  speed; return true; }
  if (dir == "right")    { l =  speed; r = -speed; return true; }
  return false;
}

/* 500 Hz. The old 100 Hz gate meant an accepted command could sit for up to
 * 10 ms before a single duty cycle was written — a tenth of the whole ramp
 * spent doing nothing, on a board whose job is to react now. dt is measured,
 * not assumed, so a finer gate makes the ramp smoother without making it
 * longer. */
#define RAMP_TICK_MS   2

static void rampApply(unsigned long dt) {
  int step = PWM_DUTY_MAX;                   /* rampMs 0 => instant */
  if (cfg.rampMs > 0) {
    step = (int)((long)PWM_DUTY_MAX * dt / cfg.rampMs);
    if (step < 1) step = 1;
  }
  bool changed = (brakingA != wroteBrakeA) || (brakingB != wroteBrakeB);
  if (liveA != targetA) {
    if (abs(targetA - liveA) <= step) liveA = targetA;
    else liveA += (targetA > liveA) ? step : -step;
    changed = true;
  }
  if (liveB != targetB) {
    if (abs(targetB - liveB) <= step) liveB = targetB;
    else liveB += (targetB > liveB) ? step : -step;
    changed = true;
  }
  if (changed) {
    /* Raise before writing duty, drop after: a bridge must never be asked for
     * a non-zero duty while it is disabled, and must never be cut while its
     * inputs still carry one. */
    setEnables(enA || (targetA != 0) || brakingA,
               enB || (targetB != 0) || brakingB);
    writeSide(true,  liveA, brakingA);
    writeSide(false, liveB, brakingB);
    wroteBrakeA = brakingA;
    wroteBrakeB = brakingB;
  }
  /* Symmetric release, and deliberately outside the dirty check: rampTick()
   * only ever RAISED the enables, so a request for zero (speed=0,
   * /tank?left=0&right=0, a ramp that has just arrived at zero) left the
   * bridges enabled with both inputs low — a low-side short, i.e. the wheels
   * locked, that the failsafe could never clear because nothing was "moving"
   * and the auto-stop could never clear because no `ms` was pending. */
  syncEnables();
}

static void rampTick() {
  const unsigned long now = millis();
  const unsigned long dt = now - lastRampMs;
  if (dt < RAMP_TICK_MS) return;
  lastRampMs = now;
  rampApply(dt);
}

/* Write the hardware NOW, in the same millisecond the command was accepted,
 * instead of waiting for the next tick. Called from every accepted drive
 * command: the bridge is already raised by then, so this is what turns "the
 * board has agreed to move" into "the wheels are being driven".
 *
 * A full RAMP_TICK_MS is charged rather than the real (near-zero) elapsed
 * time, so the first step is a normal-sized one and the ramp keeps its shape
 * — crediting 0 ms would make step 0, i.e. exactly the dead tick this exists
 * to remove. */
static void rampKick() {
  lastRampMs = millis();
  rampApply(RAMP_TICK_MS);
}

/* ───────────────────────── self test ────────────────────────────── */

