Kryn-devv/Iris_AI/firmware/esp32-iris-node-bts7960/esp32-iris-node-bts7960.ino
static void selfTestApply(int step) {
  const int s = cfg.defaultSpeed;
  switch (step) {
    /* Steps 0..3 test one module at a time, so only that module's bridge comes
     * up — the other side has to free-wheel or it drags against the test. */
    case 0: rawMode = true; targetA =  s; targetB = 0; break;
    case 1: rawMode = true; targetA = -s; targetB = 0; break;
    case 2: rawMode = true; targetA = 0; targetB =  s; break;
    case 3: rawMode = true; targetA = 0; targetB = -s; break;
    case 4: applyLogical( s,  s); break;
    case 5: applyLogical(-s,  s); break;
    case 6: applyLogical( s, -s); break;
    default: doStop(false); return;
  }
  brakingA = brakingB = false;
  syncEnables();
  rampKick();
}

static void selfTestTick() {
  if (selfStep < 0) return;
  if ((long)(millis() - selfStepAt) < 0) return;   /* rollover-safe */
  selfStep++;
  if (selfStep >= SELF_STEPS) { selfStep = -1; doStop(false); return; }
  selfTestApply(selfStep);
  selfStepAt = millis() + 900;
  lastCommandMs = millis();                  /* keep failsafe quiet */
}

/* ───────────────────────── HTTP helpers ─────────────────────────── */

/* ─────────────────── where a reply goes, where args come from ───────────────
 * A command arrives four ways: an HTTP request, a UDP datagram, a frame on the
 * page's control socket, and a frame on the cloud socket. Rather than write
 * eleven handlers four times — and watch the copies nobody tests drift — the
 * argument source and the reply sink are redirected around one set of handlers.
 *
 * curArgs is never null. It points at httpArgs (which reads the live
 * WebServer request) except while a non-HTTP frame is being served. The
 * previous version branched on a nullable pointer instead, and the HTTP arm of
 * that branch was written `argHas(name)` where it meant `server.hasArg(name)`:
 * an infinite self-call that hung the board on the first drive command and
 * looked exactly like dead wiring. See cloud_args.h.
 *
 * Commands are served one at a time from loop(), so a single slot is correct
 * here for the same reason argFail below is.                                */
static const Args httpArgs = Args::fromServer();
static const Args* curArgs = &httpArgs;
static String* cloudOut = nullptr;
static int cloudCode = 200;

static bool argHas(const char* name) { return curArgs->has(name); }
static String argGet(const char* name) { return curArgs->get(name); }

static void sendJson(int code, const String& body) {
  if (cloudOut) { *cloudOut = body; cloudCode = code; return; }
  server.sendHeader("Access-Control-Allow-Origin", "*");
  server.send(code, "application/json", body);
}

/* Name of the argument that failed to parse. Requests are handled one at a
 * time from loop(), so a single slot is enough and saves threading an error
 * object through every handler. */
static const char* argFail = NULL;

/* Present but malformed => false (the caller answers 400). Absent => the
 * caller's default is kept. Out of range is clamped, because "speed=300 means
 * full speed" is helpful whereas "speed=fast means stopped" is a trap. */
static bool argClamp(const char* name, long lo, long hi, long& out) {
  if (!argHas(name)) return true;
  long v;
  if (!parseLong(argGet(name), v)) { argFail = name; return false; }
  out = (v < lo) ? lo : (v > hi ? hi : v);
  return true;
}

/* Same, but out of range is refused rather than clamped — for values where
 * silently substituting a neighbour changes the meaning (ms=-1 clamped to 0
 * would mean "no timed stop at all", the opposite of a short move). */
static bool argRange(const char* name, long lo, long hi, long& out) {
  if (!argHas(name)) return true;
  long v;
  if (!parseLong(argGet(name), v)) { argFail = name; return false; }
  if (v < lo || v > hi) { argFail = name; return false; }
  out = v;
  return true;
}

static bool argBool(const char* name, bool& out) {
  if (!argHas(name)) return true;
  const String s = argGet(name);
  if (s == "true"  || s == "on"  || s == "yes") { out = true;  return true; }
  if (s == "false" || s == "off" || s == "no")  { out = false; return true; }
  long v;
  if (!parseLong(s, v)) { argFail = name; return false; }
  out = (v != 0);
  return true;
}

static void sendBadArg() {
  sendJson(400, String("{\"error\":\"bad value for '") + (argFail ? argFail : "?") +
                "'\",\"hint\":\"must be a whole number within range\"}");
}

static String configJson() {
  String j = "{";
  j += "\"pins\":{\"a_rpwm\":" + String(cfg.aR) + ",\"a_lpwm\":" + String(cfg.aL) +
       ",\"a_en\":" + String(cfg.aEn) + ",\"b_rpwm\":" + String(cfg.bR) +
       ",\"b_lpwm\":" + String(cfg.bL) + ",\"b_en\":" + String(cfg.bEn) + "}";
  j += ",\"swap_sides\":" + String(cfg.swapSides ? "true" : "false");
  j += ",\"invert_a\":" + String(cfg.invA ? "true" : "false");
  j += ",\"invert_b\":" + String(cfg.invB ? "true" : "false");
  j += ",\"trim_a\":" + String(cfg.trimA) + ",\"trim_b\":" + String(cfg.trimB);
  j += ",\"pwm_freq\":" + String(cfg.pwmFreq);
  j += ",\"failsafe_ms\":" + String(cfg.failsafeMs);
  j += ",\"ramp_ms\":" + String(cfg.rampMs);
  j += ",\"default_speed\":" + String(cfg.defaultSpeed);
  j += ",\"min_duty\":" + String(cfg.minDuty);
  j += ",\"brake_on_stop\":" + String(cfg.brakeOnStop ? "true" : "false");
  j += "}";
  return j;
}

static void handleStatus() {
  String j = "{\"name\":\"" + String(DEVICE_NAME) + "\",\"kind\":\"motor\"";
  j += ",\"driver\":\"bts7960x2\",\"firmware\":\"iris-robot-2.1\"";
  j += ",\"ip\":\"" + (apMode && WiFi.status() != WL_CONNECTED
                        ? WiFi.softAPIP().toString() : WiFi.localIP().toString()) + "\"";
  j += ",\"link\":\"" + String(WiFi.status() == WL_CONNECTED ? "sta" : (apMode ? "ap" : "down")) + "\"";
  j += ",\"ap_mode\":" + String(apMode ? "true" : "false");
  j += ",\"rssi\":" + String(WiFi.RSSI());
  j += ",\"uptime_s\":" + String((millis() - bootMs) / 1000);
  j += ",\"motors\":true";
  j += ",\"last_direction\":\"" + String(lastCommand) + "\"";
  j += ",\"commands\":" + String(commandCount);
  j += ",\"live\":{\"a\":" + String(liveA) + ",\"b\":" + String(liveB) + "}";
  j += ",\"target\":{\"a\":" + String(targetA) + ",\"b\":" + String(targetB) + "}";
  j += ",\"moving\":" + String((liveA || liveB) ? "true" : "false");
  j += ",\"bridges\":{\"a\":" + String(enA ? "true" : "false") +
       ",\"b\":" + String(enB ? "true" : "false") + "}";
  j += ",\"failsafe_tripped\":" + String(failsafeTripped ? "true" : "false");
  j += ",\"raw_mode\":" + String(rawMode ? "true" : "false");
  j += ",\"selftest_step\":" + String(selfStep);
  j += ",\"selftest_label\":\"" + String(selfStep >= 0 && selfStep < SELF_STEPS ? SELF_LABELS[selfStep] : "idle") + "\"";
  j += ",\"free_heap\":" + String((uint32_t)ESP.getFreeHeap());
  j += ",\"arduino_core\":" + String(ESP_ARDUINO_VERSION_MAJOR);
  /* Advertised so IRIS can find the fast path without being told about it, and
   * so an older IRIS that ignores these keys keeps working over HTTP. */
  j += ",\"fast\":{\"udp\":" + String(fast.udpPort()) +
       ",\"ws\":" + String(fast.wsPort()) +
       ",\"ws_clients\":" + String(fast.wsClients()) + "}";
  j += ",\"config\":" + configJson();
  j += "}";
  sendJson(200, j);
}

