Kryn-devv/Iris_AI/firmware/esp32-iris-node-bts7960/esp32-iris-node-bts7960.ino
/* Everything a successfully accepted drive command has in common. Called only
 * AFTER the request has been fully validated, so a rejected request can never
 * leave the machine half-changed. */
static void acceptCommand(const char* label, long ms) {
  setLastCommand(label);
  commandCount++;
  lastCommandMs = millis();
  failsafeTripped = false;
  autoStopAt = (ms > 0) ? deadlineFromNow(ms) : 0;
}

static void handleMotor() {
  String dir = argHas("dir") ? argGet("dir") : "stop";
  dir.toLowerCase();

  long speed = cfg.defaultSpeed, ms = 0;
  if (!argClamp("speed", 0, PWM_DUTY_MAX, speed) ||
      !argRange("ms", 0, MS_MAX, ms)) { sendBadArg(); return; }

  const bool isStop  = (dir == "stop");
  const bool isBrake = (dir == "brake");
  int l = 0, r = 0;
  /* Validated BEFORE anything is mutated. Cancelling a running self-test first
   * and only then discovering the direction was a typo left the motors turning
   * with the state machine that would have stopped them switched off. */
  if (!isStop && !isBrake && !directionToPair(dir, (int)speed, l, r)) {
    sendJson(400, "{\"error\":\"dir must be forward|backward|left|right|stop|brake\"}");
    return;
  }

  selfStep = -1;                              /* an accepted command wins */

  if (isStop || isBrake) {
    doStop(isBrake);
    commandCount++;
    lastCommandMs = millis();
    failsafeTripped = false;
    sendJson(200, String("{\"motor\":\"") + (isBrake ? "brake" : "stop") + "\"}");
    return;
  }

  applyLogical(l, r);
  acceptCommand(dir.c_str(), ms);
  sendJson(200, "{\"motor\":\"" + dir + "\",\"speed\":" + String(speed) +
                ",\"ms\":" + String(ms) + ",\"left\":" + String(l) +
                ",\"right\":" + String(r) + "}");
}

static void handleTank() {
  long l = 0, r = 0, ms = 0;
  if (!argClamp("left",  -PWM_DUTY_MAX, PWM_DUTY_MAX, l) ||
      !argClamp("right", -PWM_DUTY_MAX, PWM_DUTY_MAX, r) ||
      !argRange("ms", 0, MS_MAX, ms)) { sendBadArg(); return; }
  selfStep = -1;
  applyLogical((int)l, (int)r);
  acceptCommand("tank", ms);
  sendJson(200, "{\"tank\":{\"left\":" + String(l) + ",\"right\":" + String(r) + "}}");
}

static void handleDrive() {
  long y = 0, x = 0, ms = 0;
  if (!argClamp("y", -PWM_DUTY_MAX, PWM_DUTY_MAX, y) ||
      !argClamp("x", -PWM_DUTY_MAX, PWM_DUTY_MAX, x) ||
      !argRange("ms", 0, MS_MAX, ms)) { sendBadArg(); return; }
  const int l = constrain((int)(y + x), -PWM_DUTY_MAX, PWM_DUTY_MAX);
  const int r = constrain((int)(y - x), -PWM_DUTY_MAX, PWM_DUTY_MAX);
  selfStep = -1;
  applyLogical(l, r);
  acceptCommand("drive", ms);
  sendJson(200, "{\"drive\":{\"y\":" + String(y) + ",\"x\":" + String(x) +
                "},\"left\":" + String(l) + ",\"right\":" + String(r) + "}");
}

/* RAW per-side test: deliberately ignores swap/invert/trim so the answer to
 * "which physical module and which pin pair actually responds?" is unambiguous. */
static void handleTest() {
  String side = argHas("side") ? argGet("side") : "a";
  String dir  = argHas("dir")  ? argGet("dir")  : "forward";
  side.toLowerCase(); dir.toLowerCase();

  long speed = cfg.defaultSpeed, ms = 1200;
  if (!argClamp("speed", 0, PWM_DUTY_MAX, speed) ||
      !argRange("ms", 0, MS_MAX, ms)) { sendBadArg(); return; }
  if (side != "a" && side != "b") {
    sendJson(400, "{\"error\":\"side must be a or b\"}"); return;
  }
  /* Without this, dir=stop / dir=fwd / a typo / an empty dir= all spun the
   * side FORWARD with calibration bypassed. */
  if (dir != "forward" && dir != "backward") {
    sendJson(400, "{\"error\":\"dir must be forward or backward\"}"); return;
  }
  const int signedDuty = (dir == "backward") ? -(int)speed : (int)speed;

  selfStep = -1;
  rawMode = true;
  brakingA = brakingB = false;
  if (side == "a") { targetA = signedDuty; targetB = 0; }
  else             { targetA = 0; targetB = signedDuty; }
  syncEnables();     /* only the side under test: the other must free-wheel,
                      * or its locked wheels drag the robot off the answer */
  rampKick();

  char label[24];
  snprintf(label, sizeof(label), "test:%s:%s", side.c_str(), dir.c_str());
  acceptCommand(label, ms);   /* leaves rawMode set: applyLogical(), which is
                               * what clears it, is deliberately skipped here */

  String pins = (side == "a")
    ? "{\"rpwm\":" + String(cfg.aR) + ",\"lpwm\":" + String(cfg.aL) + ",\"en\":" + String(cfg.aEn) + "}"
    : "{\"rpwm\":" + String(cfg.bR) + ",\"lpwm\":" + String(cfg.bL) + ",\"en\":" + String(cfg.bEn) + "}";
  sendJson(200, "{\"test\":{\"side\":\"" + side + "\",\"dir\":\"" + dir +
                "\",\"speed\":" + String(speed) + ",\"ms\":" + String(ms) +
                "},\"pins\":" + pins + ",\"note\":\"raw mode: swap/invert/trim bypassed\"}");
}

static void handleSelfTest() {
  /* A /test button leaves a ~1.2 s auto-stop pending; without clearing it one
   * step of the sequence would silently not move. */
  autoStopAt = 0;
  selfStep = 0;
  selfTestApply(0);
  selfStepAt = millis() + 900;
  lastCommandMs = millis();
  failsafeTripped = false;
  sendJson(200, "{\"selftest\":\"started\",\"steps\":" + String(SELF_STEPS) +
                ",\"note\":\"poll /status for selftest_label\"}");
}

static void handleStop() {
  doStop(false);
  commandCount++;
  lastCommandMs = millis();
  failsafeTripped = false;
  sendJson(200, "{\"motor\":\"stop\"}");
}

static void handleConfig() {
  /* Validate a CANDIDATE copy and only commit once the whole request is known
   * good. Mutating cfg in place and reverting on error meant reloading from
   * NVS, which silently threw away any calibration the user had not saved yet.
   * A rejected argument now fails the WHOLE request: half-applying a
   * calibration change is worse than applying none of it. */
  Config next = cfg;
  bool pinsChanged = false, freqChanged = false, pinArgSeen = false;

  auto setPin = [&](const char* arg, uint8_t& field) -> bool {
    if (!argHas(arg)) return true;
    pinArgSeen = true;
    long v;
    if (!parseLong(argGet(arg), v) || !pinUsable((int)v)) { argFail = arg; return false; }
    if (field != (uint8_t)v) pinsChanged = true;
    field = (uint8_t)v;
    return true;
  };
  if (!setPin("a_rpwm", next.aR) || !setPin("a_lpwm", next.aL) || !setPin("a_en", next.aEn) ||
      !setPin("b_rpwm", next.bR) || !setPin("b_lpwm", next.bL) || !setPin("b_en", next.bEn)) {
    sendJson(400, String("{\"error\":\"'") + argFail +
                  "' is not a GPIO that can drive a motor input\","
                  "\"unusable\":\"6-11 flash, 20/24/28-31 absent, 34-39 input-only, 1/3 serial\","
                  "\"config\":" + configJson() + "}");
    return;
  }
  if (pinArgSeen) {
    const int clash = pinConflict(next);
    if (clash >= 0) {
      sendJson(400, "{\"error\":\"GPIO " + String(clash) +
                    " would have to carry two signals\",\"config\":" + configJson() + "}");
      return;
    }
  }

  long trimA = next.trimA, trimB = next.trimB, fail = next.failsafeMs,
       ramp = next.rampMs, dspd = next.defaultSpeed, mind = next.minDuty,
       freq = next.pwmFreq;
  if (!argClamp("trim_a", 0, 100, trimA) ||
      !argClamp("trim_b", 0, 100, trimB) ||
      !argClamp("failsafe_ms", 0, 60000, fail) ||
      !argClamp("ramp_ms", 0, 3000, ramp) ||
      !argClamp("default_speed", 0, PWM_DUTY_MAX, dspd) ||
      !argClamp("min_duty", 0, MIN_DUTY_MAX, mind) ||
      !argClamp("pwm_freq", 100, 25000, freq) ||
      !argBool("swap_sides", next.swapSides) ||
      !argBool("invert_a", next.invA) ||
      !argBool("invert_b", next.invB) ||
      !argBool("brake_on_stop", next.brakeOnStop)) { sendBadArg(); return; }

  next.trimA = (uint8_t)trimA;   next.trimB = (uint8_t)trimB;
  next.failsafeMs = (uint16_t)fail;
  next.rampMs = (uint16_t)ramp;
  next.defaultSpeed = (uint8_t)dspd;
  next.minDuty = (uint8_t)mind;
  if ((uint16_t)freq != next.pwmFreq) { next.pwmFreq = (uint16_t)freq; freqChanged = true; }

