Kryn-devv/Iris_AI/firmware/esp32-iris-node-bts7960/esp32-iris-node-bts7960.ino
  /* Stop on the CURRENT pins before the mapping moves under us, then commit
   * and re-arm. armHardware() releases the pins it previously claimed. */
  if (pinsChanged || freqChanged) {
    doStop(false);
    autoStopAt = 0;
    cfg = next;
    armHardware();
  } else {
    cfg = next;
  }

  String j = "{\"ok\":true,\"rearmed\":" + String((pinsChanged || freqChanged) ? "true" : "false");
  if (configHasRiskyPin(cfg))
    j += ",\"warning\":\"a chosen GPIO (0/2/12/15) is read by the bootloader; "
         "the board may refuse to start next reset\"";
  j += ",\"config\":" + configJson() + ",\"saved\":false}";
  sendJson(200, j);
}

static void handleSave() {
  const bool ok = configSave();
  sendJson(ok ? 200 : 500, String("{\"saved\":") + (ok ? "true" : "false") +
                            ",\"config\":" + configJson() + "}");
}

static void handleReset() {
  doStop(false);
  autoStopAt = 0;
  configDefaults();
  const bool saved = configSave();          /* reported: a silent failed write
                                             * means the old calibration comes
                                             * back at the next power-up */
  armHardware();
  sendJson(saved ? 200 : 500,
           String("{\"reset\":true,\"saved\":") + (saved ? "true" : "false") +
           ",\"config\":" + configJson() + "}");
}

/* ───────────────────────── dashboard ────────────────────────────── */

static void handleRoot() {
  server.sendHeader("Access-Control-Allow-Origin", "*");
  server.send_P(200, "text/html", PAGE);
}

/* ───────────────────────── setup / loop ─────────────────────────── */

static void announceSta() {
  Serial.println();
  Serial.println("=================================");
  Serial.print  ("  IRIS robot (BTS7960 x2) online:  http://");
  Serial.println(WiFi.localIP());
  Serial.println("  Calibrate:        open that address in a browser");
  Serial.println("  Register in IRIS: add device " + String(DEVICE_NAME) +
                 " at " + WiFi.localIP().toString() + " as motor");
  Serial.println("  Fast path:        UDP " + String(FastLink::UDP_PORT) +
                 ", control socket ws://" + WiFi.localIP().toString() + ":" +
                 String(FastLink::WS_PORT));
  Serial.println("=================================");
  if (MDNS.begin(DEVICE_NAME)) MDNS.addService("http", "tcp", 80);
  staAnnounced = true;
}

/* No router, wrong password, or out of range: serve our own network so the
 * calibration page is still reachable. Blocking in setup() until a router
 * appears left the board with no HTTP server at all — the one thing guaranteed
 * to make a wiring problem impossible to diagnose. */
static void startFallbackAp() {
  const String ssid = String("iris-") + DEVICE_NAME;
  /* AP_STA on the fallback path so the router keeps being retried; pure AP
   * when this is the chosen mode, because a station interface nobody asked
   * for still scans and still costs airtime. */
  WiFi.mode(AP_ONLY ? WIFI_AP : WIFI_AP_STA);
  if (!WiFi.softAP(ssid.c_str(), AP_PASSWORD)) {
    Serial.println("  could not start my own WiFi either — check the board");
    return;
  }
  apMode = true;
  Serial.println();
  Serial.println("=================================");
  Serial.println(AP_ONLY ? "  AP_ONLY: serving my own WiFi."
                         : "  No router reached. Serving my own WiFi:");
  Serial.println("    network:  " + ssid);
  Serial.println("    password: " + String(AP_PASSWORD));
  Serial.println("    then open http://" + WiFi.softAPIP().toString());
  if (!AP_ONLY) Serial.println("  Still retrying your router in the background.");
  Serial.println("=================================");
}

/* ───────────────────────── one dispatcher, four transports ────────────────
 * Redirects the argument source and the reply sink, then calls the SAME
 * handler the HTTP route would. Used by the cloud socket, the UDP fast path
 * and the page's control socket, so every endpoint — calibration included — is
 * reachable over all of them without a second copy of any handler.
 *
 * `/` is deliberately absent: it answers HTML to a browser, and none of these
 * transports has a browser on the far end.
 *
 * `out` is filled with the JSON the HTTP route would have sent; the return
 * value is true for a 2xx/3xx. */
static bool dispatchCommand(const String& path, const String& query, String& out) {
  const Args args = Args::fromQuery(query);
  curArgs = &args;
  cloudOut = &out;
  cloudCode = 200;
  argFail = NULL;

  String p = path;
  if (!p.startsWith("/")) p = "/" + p;

  if      (p == "/status")   handleStatus();
  else if (p == "/motor")    handleMotor();
  else if (p == "/tank")     handleTank();
  else if (p == "/drive")    handleDrive();
  else if (p == "/test")     handleTest();
  else if (p == "/selftest") handleSelfTest();
  else if (p == "/stop")     handleStop();
  else if (p == "/config")   handleConfig();
  else if (p == "/save")     handleSave();
  else if (p == "/reset")    handleReset();
  else sendJson(404, "{\"error\":\"unknown endpoint\"}");

  /* Restored unconditionally: left redirected, the NEXT HTTP reply would go
   * into a dangling String instead of to the browser, and the next HTTP
   * request would read its arguments out of a dead stack frame. */
  curArgs = &httpArgs;
  cloudOut = nullptr;
  return cloudCode < 400;
}

/* Same dispatch, answering the status code rather than a bare pass/fail.
 * cloudCode is deliberately left holding the handler's answer by the call
 * above, which is what makes this a read rather than a second dispatch. The
 * fast paths use this so a refused calibration says 404 or 500 on the page
 * instead of being flattened to "400, something". */
static int dispatchCode(const String& path, const String& query, String& out) {
  dispatchCommand(path, query, out);
  return cloudCode;
}

void setup() {
  Serial.begin(115200);
  delay(80);
  bootMs = millis();
  lastCommandMs = millis();
  lastRampMs = millis();

  configLoad();
  armHardware();

  WiFi.setSleep(false);                /* motor commands must not wait on power save */
  if (AP_ONLY) {
    startFallbackAp();                 /* no join attempt, so no 25 s wait */
  } else {
    WiFi.mode(WIFI_STA);
    WiFi.begin(WIFI_SSID, WIFI_PASS);
    Serial.print("Connecting to WiFi");
    const unsigned long joinDeadline = millis() + WIFI_JOIN_MS;
    while (WiFi.status() != WL_CONNECTED && (long)(millis() - joinDeadline) < 0) {
      delay(250);
      Serial.print(".");
    }
    if (WiFi.status() == WL_CONNECTED) announceSta();
    else startFallbackAp();
  }

  server.on("/",         handleRoot);
  /* Browsers ask for /favicon.ico on every page load. Without a handler each
   * one becomes a 404 plus an "[E] request handler not found" line, which
   * looks like a fault and is not one — and on a weak link that wasted round
   * trip competes with the 700 ms status poll the page depends on. 204 is the
   * correct answer: "there is no icon, stop asking." */
  server.on("/favicon.ico", []() { server.send(204); });
  server.on("/status",   handleStatus);
  server.on("/motor",    handleMotor);
  server.on("/tank",     handleTank);
  server.on("/drive",    handleDrive);
  server.on("/test",     handleTest);
  server.on("/selftest", handleSelfTest);
  server.on("/stop",     handleStop);
  server.on("/config",   handleConfig);
  server.on("/save",     handleSave);
  server.on("/reset",    handleReset);
  server.onNotFound([]() { sendJson(404, "{\"error\":\"unknown endpoint\"}"); });
  server.begin();      /* unconditional: the dashboard must exist even with no
                        * router, otherwise a wiring fault cannot be diagnosed */
  /* handleClient() sleeps 1 ms per idle pass by default. Harmless on a sensor
   * node, but here it is a millisecond of jitter on the ramp and the failsafe
   * for no benefit: loopTask runs on core 1, whose idle task is not watchdogged
   * (CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1 is off), so spinning is safe. */
  server.enableDelay(false);

  /* The millisecond path. Unconditional for the same reason as server.begin():
   * it must exist whether the robot is on your router or serving its own
   * network. */
  fast.begin(dispatchCode);

