Kryn-devv/Iris_AI/firmware/esp32-iris-node-bts7960/esp32-iris-node-bts7960.ino
  cloud.begin(CLOUD_HOST, CLOUD_PORT, "/api/v1/nodes/link", CLOUD_TOKEN,
              DEVICE_NAME, "motor", CLOUD_TLS, dispatchCommand, CLOUD_CA_CERT);
  if (cloud.enabled()) {
    Serial.println("  Cloud link:   dialling " + cloud.host() + ":" +
                   String(cloud.port()) + (cloud.tls() ? " (wss)" : " (ws)"));
    if (cloud.corrections().length())
      Serial.println("  CLOUD_HOST fixed: " + cloud.corrections());
    if (!cloud.tls())
      Serial.println("  ** CLOUD_TLS is off — the node token crosses the "
                     "internet in clear text. **");
    else if (!cloud.verified())
      Serial.println("  ** TLS on, certificate NOT checked: encrypted, but a "
                     "man in the middle could still read the token. Paste your "
                     "server's CA into CLOUD_CA_CERT to close that. **");
  }
}

void loop() {
  /* Order matters. The fast path is pumped FIRST and the ramp immediately
   * after, so a UDP datagram or a control-socket frame becomes duty on the
   * bridges within one pass of this loop. handleClient() comes last because it
   * is the one thing here that can hold the loop for a noticeable time: a
   * browser socket that connects and says nothing keeps it for up to five
   * seconds (HTTP_MAX_DATA_WAIT), which is exactly why the drive path no
   * longer depends on it. */
  const bool moving = (targetA != 0 || targetB != 0);
  fast.loop(moving);
  rampTick();

  /* Only pumped with a link up. A motor node whose WiFi dropped must keep
   * running its failsafe and ramp ticks below regardless. */
  if (WiFi.status() == WL_CONNECTED) cloud.loop();
  selfTestTick();
  server.handleClient();
  rampTick();          /* again: handleClient() may have just accepted a move */

  /* timed move finished */
  if (autoStopAt && (long)(millis() - autoStopAt) >= 0)   /* rollover-safe */
    doStop(cfg.brakeOnStop);

  /* failsafe: never keep driving into the unknown. This is the real safety net
   * — it holds whichever network the commands arrived on, and whether or not
   * any network is up at all.
   *
   * Re-read rather than reusing `moving` from the top of the loop: a stop that
   * happened during this pass (the timed auto-stop just above, a /stop that
   * handleClient() served) would otherwise be judged against a stale "yes, it
   * is moving" and reported as a failsafe trip that never happened. */
  const bool stillMoving = (targetA != 0 || targetB != 0);
  if (stillMoving && cfg.failsafeMs && selfStep < 0 &&
      (millis() - lastCommandMs) > cfg.failsafeMs) {
    Serial.println("[failsafe] no command in time — stopping");
    failsafeTripped = true;
    doStop(cfg.brakeOnStop);
  }

  /* AP_ONLY has no station side at all: WiFi.status() is permanently not
   * connected, and calling WiFi.begin() here would switch the radio out of
   * pure AP mode and drop the very network someone is driving from. */
  if (AP_ONLY) {
    // nothing to watch — the AP is up or the board is broken.
  } else if (WiFi.status() != WL_CONNECTED) {
    /* Losing the router is an instant stop only when the router is what was
     * carrying commands. In AP fallback there is no router to lose, and
     * stopping there would cut off someone driving from the fallback network. */
    if (!apMode && stillMoving) {
      Serial.println("[failsafe] WiFi lost — stopping");
      failsafeTripped = true;
      doStop(cfg.brakeOnStop);
    }
    staAnnounced = false;
    static unsigned long lastRetry = 0;
    if (millis() - lastRetry > 5000) {
      lastRetry = millis();
      WiFi.begin(WIFI_SSID, WIFI_PASS);
    }
  } else if (!staAnnounced) {
    announceSta();                     /* joined (or re-joined) the router */
  }
}
